global _start

section .text
_start:
    ; Підготовка до системного виклику write
    mov eax, 4          ; Номер системного виклику sys_write (4 для 32-бітної системи)
    mov ebx, 1          ; Файловий дескриптор (1 = stdout)
    mov ecx, message    ; Адреса повідомлення
    mov edx, 7          ; Довжина повідомлення
    int 0x80            ; Виклик системного виклику

    ; Підготовка до системного виклику exit
    mov eax, 1          ; Номер системного виклику sys_exit (1 для 32-бітної системи)
    xor ebx, ebx        ; Статус виходу 0
    int 0x80            ; Виклик системного виклику

section .data
message: db "KI-233", 10 ; Повідомлення, 10 - символ нового рядка
