.global _start // Позначає _start як глобальний символ,
// доступний для лінкера
.align 2 // Вирівнює наступний код за адресою,
// кратною 4
.text // Початок секції коду
_start:
// Налаштування параметрів для системного виклику write
mov x0, #1 //Файловий дескриптор: 1 - (stdout,
//стандартний вивід)
adrp x1, message@PAGE //Завантаження старших бітів адреси
//повідомлення
add x1, x1, message@PAGEOFF //Додавання зміщення для отримання
//повної адреси
mov x2, #7 //Довжина повідомлення(7 символів включно з \n)
// Виконання системного виклику write
mov x16, #4 //Номер системного виклику для write
svc #0x80 //Викликати системний виклик (supervisor call)
// Вихід з програми
mov x0, #0 // Статус виходу: 0 (успішне завершення)
mov x16, #1 // Номер системного виклику для exit
svc #0x80 // Викликати системний виклик exit
.data // Початок секції даних
message:
.ascii "KI-231 Halaburda\n" // Повідомлення з символом нового рядка

//ld -o lab2 lab2.o -lSystem -syslibroot $(xcrun --show-sdk-path) -e _start
//as -o lab2.o lab2.s